# У вас есть переменная code
# Напишите программу, проверяющую
# её значение и в зависимости от того больше 
# ли code 10 или нет, должен выводиться
# текст "пароль надёжный" или 
# "пароль ненадёжный"

code = 7

if code > 10:
    print("Пароль надёжный")
else:
    print("Пароль ненадёжный")
