# # Вывести чётные числа от 1 до 100
i = 1

while i <= 100:
    if i % 2 == 0:
        print(i)
    i += 1  # тоже же самое, что i = i + 1


# Вывести чётные числа от 1 до 100
i = 2

while i <= 100:
    print(i)
    i += 2
 