# Вывести числа от 1 до 100, которые кратны 3 и 5

i = 1

while i <= 100:
    if i % 3 == 0 and i % 5 == 0:
        print(i)
    i += 1

# Вывести чётные числа от 1 до 100
i = 15

while i <= 100:
    print(i)
    i += 15
 