# Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
# Выведите все элементы, которые меньше 7.      V
# Выведите первый и последний элемент списка.
# Выведите общее количество элементов.

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
i = 0
c = 0
while i < len(a):
    if a[i] < 7:
        print(a[i])
    i = i + 1
    c = c + 1

print(a[0])
print(a[len(a)-1])
print(a[-1])    # V

print(len(a))   # V
print(c)

print(a[-3])