# Тройка Пифагора - три натуральных числа a < b < c, для которых выполняется равенство

# a2 + b2 = c2
# Например, 32 + 42 = 9 + 16 = 25 = 52.

# Существует только одна тройка Пифагора, для которой a + b + c = 1000.
# Найдите произведение abc.


# v1 
# a, b, c = 1, 1, 1

# while a < 1000:
#     b = 1
#     while b < 1000:
#         c = 1
#         while c < 1000:
#             # print(a, b, c)
#             if a < b < c:
#                 if a ** 2 + b ** 2 == c ** 2:
#                     if a + b + c == 1000:
#                         print(a * b * c)

#             c += 1
#         b += 1
#     a += 1


# v2
a, b, c = 1, 1, 1

while a < 1000:
    b = 1
    while b < 1000:
        c = (a ** 2 + b ** 2) ** 0.5
        # print(a, b, c)
        if a < b < c:
            if a + b + c == 1000:
                print(a, b, c)
                print(a * b * c)
                
        b += 1
    a += 1