"""
1. Создайте программу, которая выведет на консоль информацию о Вас.
Необходимая информация:
ФИО
Возраст
Пол
Место работы
Место учебы
Курс
Направление
Изучали ли программирование ранее
Желаемая зарплата.
Вывод на ваше усмотрение (Но все данные должны быть)
"""

fio = 'Аманбаев Каюм'
age = 29
gender = 'Male'
work_place = 'Red Petroleum'
study_place = "IUK"
course = 'JavaScript'
direction = 'IT'
learned_code = 'yes'
salary = '1000'

print(fio, age)
print(course)
print(course)
print(course)
print(course)
